Revit 2024 API
BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForDiameter Property
 Lining Thickness ([Lining Thickness Value]) is too large for current Diameter ([Diameter Value]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LiningThicknessIsLargeForDiameter { get; }
Visual Basic
Public Shared ReadOnly Property LiningThicknessIsLargeForDiameter As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LiningThicknessIsLargeForDiameter {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace